Revit 2027 API
CylindricalSurface.Radius Property
 Radius of the circle that defines the base of this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
public:
property double Radius {
	double get ();
}
member Radius : float with get
Property Value
Double
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace